     H
     DPrompt           S              5A
     DResult           S              5A
      /Free

       DsPly 'Demo CDS Americas 1 DELTA 3 00001X';
       DsPly 'Demo CDS Americas 1 DELTA 3 00001X';
       DsPly 'Demo CDS Americas 1 DELTA 3 RFC111';
       DsPly 'Demo CDS Americas 1 DELTA 3 111111';
       DsPly 'Demo CDS Americas 1 DELTA 3 555555';
       DsPly 'Demo CDS Americas 1 DELTA 3 222222';
       DsPly Prompt '' Result;

       *InLr= *ON;
      /End-Free
