     H
     DPrompt           S              5A
     DResult           S              5A
      /Free

       DsPly 'Davivienda el Banco de Panama';
       DsPly Prompt '' Result;

       *InLr= *ON;
      /End-Free
