/********************************************************************/
/*                                                                  */
/* CDS Americas 0000028                         Miguel Garcia       */
/*                                                                  */
/********************************************************************/
             PGM

             WRKACTJOB  SBS(QBATCH)
             WRKSYSACT  SEQ(*CPU)
             ENDPGM
